app/Models/Tabla_productos.php

SELECT `id_producto`, `estatus_producto`, `nombre_producto`, `descripcion`, `cantidad`, `eliminacion`
FROM `productos`
ORDER BY `nombre_producto` ASC
---
    public function datatable_productos()
    {
        $resultado = $this
            ->select('id_producto, estatus_producto, nombre_producto, descripcion, cantidad, eliminacion')
            ->orderBy('nombre_producto', 'ASC')
            ->withDeleted()
            ->findAll();